spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/with_valid_card/sets_an_id.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=6&card[exp_year]=2017&card[cvc]=123
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.56.0
      Authorization:
      - Bearer sk_test_uv6jMSQ54DycvURjLCpORYLW
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.56.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin15.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        maggios-MacBook-Pro-806.local 16.1.0 Darwin Kernel Version 16.1.0: Thu Oct
        13 21:26:57 PDT 2016; root:xnu-3789.21.3~60/RELEASE_X86_64 x86_64","hostname":"maggios-MacBook-Pro-806.local"}'
      Content-Length:
      - '81'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 04 Nov 2016 13:53:19 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '781'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_9V8OsPPlkyvLX0
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_19C88BFgeUvs3GmukxKlUEbl",
          "object": "token",
          "card": {
            "id": "card_19C88BFgeUvs3GmuTxiVw1GM",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 6,
            "exp_year": 2017,
            "fingerprint": "BKTw6Ixt61DE2nPW",
            "funding": "credit",
            "last4": "4242",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "173.10.171.149",
          "created": 1478267599,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Fri, 04 Nov 2016 13:53:19 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: source=tok_19C88BFgeUvs3GmukxKlUEbl&plan=myflix_basic&email=a%40b.c
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.56.0
      Authorization:
      - Bearer sk_test_uv6jMSQ54DycvURjLCpORYLW
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.56.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin15.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        maggios-MacBook-Pro-806.local 16.1.0 Darwin Kernel Version 16.1.0: Thu Oct
        13 21:26:57 PDT 2016; root:xnu-3789.21.3~60/RELEASE_X86_64 x86_64","hostname":"maggios-MacBook-Pro-806.local"}'
      Content-Length:
      - '67'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 04 Nov 2016 13:53:20 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2424'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_9V8OLklqQOxNpL
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_9V8OWImuQsFuco",
          "object": "customer",
          "account_balance": 0,
          "created": 1478267599,
          "currency": "usd",
          "default_source": "card_19C88BFgeUvs3GmuTxiVw1GM",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "a@b.c",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_19C88BFgeUvs3GmuTxiVw1GM",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_9V8OWImuQsFuco",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 6,
                "exp_year": 2017,
                "fingerprint": "BKTw6Ixt61DE2nPW",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_9V8OWImuQsFuco/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_9V8OHuCtuwO6iC",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1478267599,
                "current_period_end": 1480859599,
                "current_period_start": 1478267599,
                "customer": "cus_9V8OWImuQsFuco",
                "discount": null,
                "ended_at": null,
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "myflix_basic",
                  "object": "plan",
                  "amount": 999,
                  "created": 1478198264,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "MyFlix - Basic",
                  "statement_descriptor": "myflix basic",
                  "trial_period_days": null
                },
                "quantity": 1,
                "start": 1478267599,
                "status": "active",
                "tax_percent": null,
                "trial_end": null,
                "trial_start": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_9V8OWImuQsFuco/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Nov 2016 13:53:20 GMT
recorded_with: VCR 3.0.3
